{
  "pages": [
    {
      "title": "About",
      "text": "This page provides a brief history lesson as to what indicators are and\nhow this project came to be.\nWhat are Indicators anyway?\nThe panel indicator area was introduced in an early version of GNOME\nsomewhat based on the Microsoft Windows '95 design, as an area\ndedicated to notifications. It is often called the systray or the\nnotification area.\nPrior to Indicators the notification area was difficult for users to\ninteract with, each application behaved differently, were not\naccessible and were often styled differently.\nIndicators migrated the different applets to simple menus, this\nchange provided a more consistent interface and improved the user\nexperience of interacting with panel indicators.\nIf you are still wondering what the heck Indicators are, this image from\nUbuntu MATE should help.\n\nWhy Ayatana Indicators?\nCanonical announced the discontinuation of Unity on the desktop and\nmobile devices in April 2017. As Ubuntu shifts its focus to GNOME,\nwhich is dropping the panel indicator concept entirely, it is fair\nassumption that upstream maintainence of application indicators and\nrelated technologies will decline or come to end entirely.\nThere are a number of projects that are already using indicators and/or\nit's associated libraries such as MATE\nDesktop, XFCE and\nArctica Greeter.\nThe UBports project has also expressed\ninterest. These projects all really like the indicator concept and wish\nto see it maintained and continued.\nTo better understand the origins of the project and the goals for the\nfuture you can hear it from the Ayatana Indicator project lead, Mike\nGabriel, from his Ayatana Indicators talk at\nDebConf17.\n\n  \n    \n      \n        \n      \n    \n  \n\n\nGet Involved!\nIf this project sounds like something you'd like to be a part of then\nplease contact us or take a look at our roadmap\nand donate some code!",
      "tags": "",
      "url": "https://AyatanaIndicators.github.io/about/"
    },
    {
      "title": "Contact",
      "text": "IRC\nThe developers and contributors to the Ayatana Indicators project hangout in \nthe #debian-ayatana IRC channel on irc.debian.org provide by OFTC.",
      "tags": "",
      "url": "https://AyatanaIndicators.github.io/contact/"
    },
    {
      "title": "Ayatana Indicators website launch",
      "text": "The Ayatana Indicators project website is now live! We'll be\nusing this site to share project updates and reference material.\nThe Ayatana Indicators project is the continuation of Application\nIndicators,\na technology developed by Canonical for\nthe Unity desktop. We intend to\nbecome the new upstream for application indicators and associated\nprojects, with a focus on making Ayatana Indicators a desktop agnostic\ntechnology.\nGet Involved!\nIf this project sounds like something you'd like to be a part of then\nplease contact us or take a look at our roadmap\nand donate some code!",
      "tags": "",
      "url": "https://AyatanaIndicators.github.io/blog/ayatana-indicators-website-launch/"
    },
    {
      "title": "Code",
      "text": "The Ayatana Indicators upstream project components are hosted\non GitHub. Donations of code are warmly welcomed!\n\nAyatana Indicators GitHub\n\nRoadmap\n\nMaking appindicators more generic, so that all Linux distributions can use the framework without heavy patching at packaging time.\nDropping all hints to the com.canonical.indicator namespace in DBus configurations and replacing such occurrences with org.ayatana.indicator namespace.\nDropping all hints to \"(U|u)(N|n)(I|i)(T|t)(Y|y)\" in path names and variables and replacing them by some similar capitalization of the word Ayatana.\nMaking the forks co-install just fine with Ubuntu's appindicator packages when installing on Ubuntu.\nMaking appindicators and esp. the various indicator applets independent from Ubuntu-only aspects / implementations: upstart, click package format/system, Mir, etc.\nProviding a DBus proxy service that can pipe indicator implementations trying to connect to com.canonical.indicator.application.service through to our non-Ubuntu indicator application service implementation (listening on org.ayatana.indicator.application.service).\nPackage all Ayatana Indicators and associated libraries for Debian and land them in stable in time for Debian 10 (Buster).\n\nFor more, slightly out dated, background on the roadmap see Mike's blog about Making appindicators available for non-Ubuntu platforms.\nDistribution packages\nDebian\nThe Debian packages are maintained under the umbrella of the revived Ayatana Packagers team.\n\nAyatana Packagers team\n\nUbuntu\nMembers of Ubuntu MATE and Xubuntu are contributing to the Debian Ayatana Packagers team (see above).",
      "tags": "",
      "url": "https://AyatanaIndicators.github.io/code/"
    },
    {
      "title": "Welcome to Ayatana Indicators",
      "text": "The Ayatana Indicators project is the continuation of Application\nIndicators,\na technology developed by Canonical for\nthe Unity desktop.\nApplication Indicators are a GNOME implementation of the\nStatusNotifierItem\nSpecification\n(SNI) that was originally submitted to freedesktop.org by\nKDE. The Ayatana Indicator project intends to become\nthe new upstream for application indicators and associated projects\nwith a focus on making Ayatana Indicators a desktop agnostic\ntechnology.\nRead our about page to learn more about what indicators are\nand why this project was started.\nGet Involved!\nIf this project sounds like something you'd like to be a part of then\nplease contact us or take a look at our roadmap\nand donate some code!",
      "tags": "",
      "url": "https://AyatanaIndicators.github.io/"
    }
  ]
}